In [26]:
import sqlite3

In [27]:
db = sqlite3.connect('jointable.db')
# creating database and name of database is jointable

In [4]:
c = db.cursor()
# it is a connction variable

In [6]:
c.execute('create table student(student_id int, student_name text, marks int)')
# creating table 1 that is bydefault left table

In [21]:
c.execute('create table address(student_id int, location text, phone_no text)')
# creating table 2 that is right table

In [9]:
c.execute("insert into student values(121, 'sudhanshu', 144)")
c.execute("insert into student values(122, 'vijay', 145)")
c.execute("insert into student values(123, 'krish', 445)")
c.execute("insert into student values(124, 'srd', 440)")

In [11]:
for i in c.execute("select * from student "):
    print(i)

(121, 'sudhanshu', 144)
(122, 'vijay', 145)
(123, 'krish', 445)
(124, 'srd', 440)

In [22]:
c.execute("insert into address values(121, 'pune', 830883)")
c.execute("insert into address values(122, 'pune', 848484)")
c.execute("insert into address values(125, 'banglore', 832121)")
c.execute("insert into address values(124, 'pune', 914696)")

In [23]:
for i in c.execute("select * from address"):
    print(i)

(121, 'pune', '830883')
(122, 'pune', '848484')
(125, 'banglore', '832121')
(124, 'pune', '914696')

In [24]:
data = c.execute("select * from student s left join address a on s.student_id = a.student_id")

In [25]:
for i in data:
    print(i)

(121, 'sudhanshu', 144, 121, 'pune', '830883')
(122, 'vijay', 145, 122, 'pune', '848484')
(123, 'krish', 445, None, None, None)
(124, 'srd', 440, 124, 'pune', '914696')

In [ ]:
Above shown the operation of left join where table A(student) and table B(Address)
it will combine with common factor that is stuent_id 
In this case left table will fetch everything.